app/views/menus/_add_menu.html.erb

      <p class="item-label">description : </p>
      <%= form.select'description', raw("<option selected disabled>Select</option><option>south indian</option><option>north indian</option><option>chineese</option><option>tandoori</option>"), class:"item-input"%>
---
SELECT "menu_items".* FROM "menu_items"

      <p class="item-label">category : </p>
      <%= form.select'category', raw("<option selected disabled>Select</option><option>Breakfast</option><option>lunch</option><option>Dinner</option><option>Cold Drinks</option>"), class:"item-input"%>
---
SELECT "menu_items".* FROM "menu_items"

       <p class="item-label">Menu : </p>
      <%= form.select 'menu', options_for_select(menu.collect{ |u| [u.name, u.id] }) , class:"item-input"%>
---
SELECT "menu_items".* FROM "menu_items"
SELECT "menus".* FROM "menus"

        <p class="item-label">menu : </p>
        <%= form.select 'menu', options_for_select(menu.collect{ |u| [u.name, u.id] }) , class:"item-input"%>
---
SELECT "menus".* FROM "menus"