app/views/menus/edit.html.erb

  <strong>Delete menu ?</strong>
  <%Menu.all.each do |m|%>
---
SELECT "menus".* FROM "menus"