app/views/menus/index.html.erb

SELECT "menus".* FROM "menus"
---
<%= render partial: "add_menu", locals:{
         section_title_1: "Add menu_item",
         menu: Menu.all,
         section_title_2: "Add menu",
         section_title_3: "available menus"