app/views/menu_items/index.html.erb

SELECT "menus".* FROM "menus"
---
      <span class="item-label">Description : </span>
      <%= form.select'description', raw("<option selected disabled>select</option><option>South Indian</option><option>North Indian</option><option>Starters</option><option>Rice And Noodles</option><option>Briyani</option><option>Italian</option>
      <option>Tandoori</option><option>Milk Shakes</option>"), class:"item-input"%>
      <span class="item-label">Item Image: </span>
      <%= form.text_field 'image' ,class:"item-input"%>
      <span class="item-label">Category of: </span>
      <%= form.select 'category', raw("<option selected disabled>select</option><option>Breakfast</option><option>lunch</option><option>Dinner</option><option>Cold Drinks</option>"), class:"item-input"%>
      <%=form.submit "add", class:"item-submit" %>

     <%end%>
  </div>


 <main class='menu-body'>
  <div class="below1">
    <div class="below1-right">

        <h3>choose a menu to display</h3>
        <%= form_with(url:  setmenu_path, method: :post, class: "Add-menu") do %>
          <select name="menu_id"
            class="Menu-select"
            onchange ='if(this.value != 0) { this.form.submit(); }'