app/views/orders/_user-cart.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
            <% user_id = order.user_id %>
              <% user = User.find(user_id)%>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
            <%user_id = order.user_id %>
            <% user = User.find_by(id:user_id)%>