app/views/orders/index.html.erb

          <% user_id = order.user_id %>
          <% user=User.find(user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]