app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def current_user
    return @current_user if @current_user
    current_user_id = session[:current_user_id]
    if current_user_id
      @current_user = User.find(current_user_id)

SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "menus".* FROM "menus" ORDER BY "menus"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def current_menu
    if Rails.cache.fetch("current_menu_id")
      @current_menu_id = Rails.cache.read("current_menu_id")
      return @menu = Menu.find(@current_menu_id)
    else
      Rails.cache.write("current_menu_id", Menu.first.id)