app/controllers/menu_items_controller.rb

  def index
    if @current_user.role == "user"
      order = Order.current_order(current_user)
      @order = order
      if order
        @order_items = OrderItem.where("order_id = ?", order.id)
---
SELECT "menu_items".* FROM "menu_items" WHERE (category_name = 'Breakfast' and menu_id = 2)