app/controllers/menu_items_controller.rb

  def index
    render "index"
    menu = Menu.all
---
SELECT "menus".* FROM "menus"

  def create
    name = params[:item]
    price = params[:rate]
    description = params[:description]
    category = params[:category]
    menu = params[:menu]

    new_item = MenuItem.new(name: name,
                            price: price,
                            description: description,
                            category_name: category,
                            menu_id: menu)
    if new_item.save
---
INSERT INTO "menu_items" ("name", "description", "price", "created_at", "updated_at", "menu_id", "category_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    id = params[:id]
    menu_item = MenuItem.find(id)
    menu_item.name = params[:name]
    menu_item.price = params[:price]
    menu_item.save!
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "menu_items" SET "price" = $1, "updated_at" = $2 WHERE "menu_items"."id" = $3  [["price", "35.0"], ["updated_at", "2020-05-10 08:52:22.986820"], ["id", 18]]

  def destroy
    id = params[:id]
    menu_item = MenuItem.find(id)
    menu_item.destroy
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 21]]