app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @menu = Menu.all

INSERT INTO "menus" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Special Menu"], ["created_at", "2020-05-12 08:42:05.892166"], ["updated_at", "2020-05-12 08:42:05.892166"]]
---
  def create
    name = params[:menu]
    new_menu = Menu.new(name: name)
    if new_menu.save

SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    id = params[:id]
    @edit_menu = Menu.find(id)

SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 3]]
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 7]]
---
  def destroy
    id = params[:id]
    menu_to_be_delted = Menu.find(id)
    if current_menu == menu_to_be_delted && current_menu
      list_menu = Menu.find_next_menu(menu_to_be_delted)
      Rails.cache.write("current_menu_id", list_menu.first.id)
      menu_to_be_delted.destroy
    elsif !current_menu
      flash[:error] = "Error - Cannot delete all Menus"
    else
      menu_to_be_delted.destroy