app/controllers/order_items_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]
---
  def index
    if @current_user.role == "user"
      order = Order.current_order(current_user)
      @order = order
      @order_items = OrderItem.where("order_id = ?", order.id)

      render "index"
    end
    if @current_user.role == "clerk"
      @customer = walk_in_customer
      order = Order.current_order(@customer)
      @order = order
      @order_items = OrderItem.where("order_id = ?", order.id)