app/controllers/order_items_controller.rb

  def index
    if @current_user.role == "user"
      order = Order.current_order(current_user)
      @order = order
      @order_items = OrderItem.where("order_id = ?", order.id)
      render "index"
    end
    if @current_user.role == "clerk"
      @customer = User.find_by(name: "walk-in customer")
      order = Order.current_order(@customer)
      @order = order
      @order_items = OrderItem.where("order_id = ?", order.id)
---
SELECT "order_items".* FROM "order_items" WHERE (order_id = 44)
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "walk-in customer"], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 170], ["LIMIT", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def add
    id = params[:id]
    order_item = OrderItem.find(id)

    order = Order.current_order(current_user)
    order_item.quantity = order_item.quantity + 1
    order_item.save!
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 182], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 2], ["updated_at", "2020-05-14 08:11:11.576873"], ["id", 182]]

  def remove
    id = params[:id]
    order_item = OrderItem.find(id)

    order = Order.current_order(current_user)
    if order_item.quantity > 0
      order_item.quantity = order_item.quantity - 1
      order_item.save!
      redirect_to order_items_path
    end
    if order_item.quantity == 0
      order_item.delete
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 182], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 1], ["updated_at", "2020-05-14 07:44:59.792577"], ["id", 180]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 182]]

  def update
    id = params[:id]
    item = MenuItem.find(id)
    order = Order.current_order(current_user)
    cart_item = OrderItem.new(
      menu_item_id: id,
      menu_item_name: item.name,
      menu_item_price: item.price,
      quantity: params[:quantity],
      order_id: order.id,
    )
    if !cart_item.save
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "orders" ("date", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-05-14"], ["created_at", "2020-05-14 06:58:28.038249"], ["updated_at", "2020-05-14 06:58:28.038249"], ["user_id", 17], ["status", "not placed"]]
INSERT INTO "order_items" ("created_at", "updated_at", "order_id", "menu_item_id", "menu_item_name", "menu_item_price", "quantity") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def offline_customer
    @customer = User.find_by(name: "walk-in customer")
    new_order = Order.create!(user_id: @customer.id,
                              date: Date.today,
                              status: "not placed")

    id = params[:id]
    item = MenuItem.find(id)
    order = Order.current_order(@customer)
    cart_item = OrderItem.new(
      menu_item_id: id,
      menu_item_name: item.name,
      menu_item_price: item.price,
      quantity: params[:quantity],
      order_id: order.id,
    )
    if cart_item.save
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "walk-in customer"], ["LIMIT", 1]]
INSERT INTO "orders" ("date", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-05-14"], ["created_at", "2020-05-14 07:14:09.964263"], ["updated_at", "2020-05-14 07:14:09.964263"], ["user_id", 17], ["status", "not placed"]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
INSERT INTO "order_items" ("created_at", "updated_at", "order_id", "menu_item_id", "menu_item_name", "menu_item_price", "quantity") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    id = params[:id]
    order_item = OrderItem.find(id)
    order_item.destroy
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 188], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 188]]