app/controllers/orders_controller.rb

  def create
    Order.create!(user_id: @current_user.id,
                  date: Date.today,
                  status: "not placed")
---
INSERT INTO "orders" ("date", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-05-04"], ["created_at", "2020-05-04 07:07:47.998454"], ["updated_at", "2020-05-04 07:07:47.998454"], ["user_id", 12], ["status", "not placed"]]

  def update
    id = params[:id]
    order = Order.find(id)
    order.status = "received"
    order.save!
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "received"], ["updated_at", "2020-05-07 06:15:37.153235"], ["id", 106]]

  def deliver_order
    id = params[:id]
    order = Order.find(id)
    order.status = "delivered"
    time = Time.now
    order.delivered_at = Time.now.to_formatted_s(:long)
    order.save!
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 151], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "delivered_at" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["status", "delivered"], ["delivered_at", "2020-05-14 12:53:00"], ["updated_at", "2020-05-14 07:23:45.464230"], ["id", 151]]

  def destroy
    id = params[:id]
    order = Order.of_user(current_user).find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]