app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "gnanesh007.mk@gmail.com"], ["LIMIT", 1]]
INSERT INTO "orders" ("date", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2020-05-02"], ["created_at", "2020-05-02 08:24:30.879334"], ["updated_at", "2020-05-02 08:24:30.879334"], ["user_id", 12], ["status", "not placed"]]
---
  def create
    user = User.find_by(email: params[:email])
    if user && user.authenticate(params[:password])
      session[:current_user_id] = user.id
      flash[:notice] = " you're signed in !"
      if user.role == "user"
        new_order = Order.create!(user_id: user.id,
                                  date: Date.today,
                                  status: "not placed")