app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    new_user = User.new(name: params[:name],
                        email: params[:email],
                        password: params[:password])
    if new_user.save!