app/models/menu.rb

  def self.findmenu(menu_id)
    menu = Menu.find(id: menu_id)
---
SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]