app/models/order.rb

SELECT "orders".* FROM "orders" WHERE (user_id = 1 and status = 'not placed') ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def self.current_order(user)
    all.where("user_id = ? and status = ?", user.id, "not placed").last

SELECT "orders".* FROM "orders" WHERE (user_id = 12 and status = 'received') ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def self.user_delivered(user)
    all.where(user_id: user.id, status: "delivered")

SELECT "orders".* FROM "orders" WHERE (user_id = 12 and status = 'not placed') ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def self.last_order(user)
    all.where("user_id = ?", user.id).last